{
    "changelog": 
    [
        {
            "version":"1.8.2-alpha",
            "date":"2024-06-03",
            "entries":
            [
                {
                    "type": "New Feature: Combo Kill Announcer",
                    "description": "Added a combo kill announcer which will display the number of enemies killed in a 0.25s period."
                },
                {
                    "type":"New Upgrade : Shrapnel Bazooka Launcher",
                    "description":"Bazooka Launcher has a new upgrade which deals bleed damage to enemies hit by the explosion."
                },
                {
                    "type":"QOL",
                    "description":"Reduced the amount of shake on the player's HP text when low HP, made the text color orange when at low hp."   
                },
                {
                    "type":"Bug Fix",
                    "description":"Fixed issue where neutral element cards would apply their status effect twice when hitting a marked target"
                }
            ]
        },
        {
            "version":"1.8.1-alpha",
            "date":"2024-06-02",
            "entries":
            [
                {
                    "type": "New Feature: Developer Console",
                    "description": "Added a developer console which can be accessed by pressing the ` key. The console will show log, warning and error messages."
                },
                {
                    "type":"New Upgrade : Piercing Marking Arrow",
                    "description":"Marking Arrow has a new upgrade path which allows it to pierce through enemies and deal damage and apply mark to all enemies it hits."   
                }
            ]
        },
        {
            "version":"1.8.0-alpha",
            "date":"2024-06-01",
            "entries":
            [
                {
                    "type":"Major Feature: Upgradeable Cards",
                    "description":"There is a new upgrade system in the game! You can now find anvils on Rest Stages which will allow you to upgrade your cards. At the moment most cards have a single upgrade path with simple stat improvements though I plan to add more interesting upgrades in the future."
                    
                }
            ]
        },

        {
            "version": "1.7.4-alpha",
            "date": "2024-05-28",
            "entries": [
                {
                    "type": "New Card : Electro Orb",
                    "description": "Fire an electric orb in a straight line which deals damage and stuns the first enemy hit"
                },
                {
                    "type": "QOL",
                    "description": "Changed the key to activate Focus Mode from Q to F."
                },
                {
                    "type": "QOL",
                    "description": "Added the ability to view your deck whilst in the Stage Select screen."
                },
                {
                    "type": "New Feature: Changelog",
                    "description":"Added this, the changelog! Now you can see what's new in the game in the main menu!"
                }
            ]
            

        }


    ]
}
